Repository: UnsaltedScholar/krohnkite
Catalog: translations/*.po
Languages: russian

source: Make the window float if its property: skipPager=true (HACK)
russian: Сделать окно плавающем если его свойство: skipPager=true (HACK)

source: Log
russian: Лог

source: Use this option to debug the script or submit detailed bug report.
russian: Включить отладку скрипта

source: Logging
russian: Логирование

source: <html><head/><body><p><span style=" font-size:12pt;">logs all windows that Krohnkite indexes and manages</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">Логи всех окон которыми Krohnkite управляет</span></p></body></html>

source: Added new windows
russian: Добавленные новые окна

source: <html><head/><body><p><span style=" font-size:12pt;">logs all windows that Krohnkite does not manage for many reasons: service, dialog, etc.</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">включает логирование всех новых окон, которыми Krohnkite не управляет по разным причинам: service, dialog, etc.</span></p></body></html>

source: Filtered new windows
russian: Отфильтрованные новые окна

source: <html><head/><body><p><span style=" font-size:12pt;">logs all windows that Krohkite could manage if not for the filters in the configuration</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">Логи всех окон которыми Krohkite мог бы управлять если бы они не были отфильтрованы с помощью конфигурации.</span></p></body></html>

source: Unmanaged new windows
russian: Отфильтрованные новые окна

source: <html><head/><body><h4 style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:medium; font-weight:700;">Filtering log modules</span></h4><p>the group of the log modules checkbox enables the entire group of log modules at once and in order to include only certain modules there is a line-edit nearby. Examples:</p><ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Hack';">1,4-</span> - enable only the first and from the fourth to the last module</li><li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Hack';">!1,4-6</span> - the exclamation mark at the beginning turns on the exclude mode, so this line will enable all modules except 1 and from 4 to 6. <span style=" font-family:'Hack';">!</span> - the exclamation mark you can use only once in the beginning, to enable the exclude mode.</li></ul></body></html>
russian: <html><head/><body><h4 style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:medium; font-weight:700;">Фильтр лог модулей</span></h4><p>чекбокс рядом с названием группы включает все модули в этой группе; чтобы включить только определённые модули нужно написать их порядковые номера рядом в строке. Примеры:</p><ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Hack';">1,4-</span> - включит первый модуль и все модули с четвёртого до последнего</li><li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Hack';">!1,4-6</span> - восклицательный знак включит режим исключения; в этом примере будут включены все модули кроме 1,4,5 и 6. <span style=" font-family:'Hack';">!</span> - восклицательный знак можно использовать только раз в начале.</li></ul></body></html>

source: filter log modules popup tooltip <<<hover me>>>
russian: Подсказка для фильтра лог модулей <<<наведи на меня>>>

source: <html><head/><body><h5 style=" margin-top:12px; margin-bottom:4px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:11pt; font-weight:700;">Workspace signals log modules</span></h5><p><span style=" font-size:11pt;">1. screensChanged</span></p><p><span style=" font-size:11pt;">2. virtualScreenGeometryChanged</span></p><p><span style=" font-size:11pt;">3. currentActivityChanged</span></p><p><span style=" font-size:11pt;">4. currentDesktopChanged</span></p><p><span style=" font-size:11pt;">5. windowAdded</span></p><p><span style=" font-size:11pt;">6. windowActivated</span></p><p><span style=" font-size:11pt;">7. windowRemoved</span></p><p><br/></p></body></html>
russian: <html><head/><body><h5 style=" margin-top:12px; margin-bottom:4px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:11pt; font-weight:700;">Список лог модулей сигналов Workspace </span></h5><p><span style=" font-size:11pt;">1. screensChanged</span></p><p><span style=" font-size:11pt;">2. virtualScreenGeometryChanged</span></p><p><span style=" font-size:11pt;">3. currentActivityChanged</span></p><p><span style=" font-size:11pt;">4. currentDesktopChanged</span></p><p><span style=" font-size:11pt;">5. windowAdded</span></p><p><span style=" font-size:11pt;">6. windowActivated</span></p><p><span style=" font-size:11pt;">7. windowRemoved</span></p><p><br/></p></body></html>

source: <html><head/><body><p><span style=" font-size:11pt; font-weight:700;">All other log modules</span></p><p><span style=" font-size:11pt;">1. shortcut</span></p><p><span style=" font-size:11pt;">2. arrangeScreen</span></p><p><span style=" font-size:11pt;">3. printConfig</span></p><p><span style=" font-size:11pt;">4. setTimeout</span></p><p><span style=" font-size:11pt;">5. window</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:11pt; font-weight:700;">Все прочие лог модули</span></p><p><span style=" font-size:11pt;">1. shortcut</span></p><p><span style=" font-size:11pt;">2. arrangeScreen</span></p><p><span style=" font-size:11pt;">3. printConfig</span></p><p><span style=" font-size:11pt;">4. setTimeout</span></p><p><span style=" font-size:11pt;">5. window</span></p></body></html>

source: Workspace signals
russian: Workspace сигналы

source: Window signals
russian: Сигналы Окна

source: <html><head/><body><h5 style=" margin-top:12px; margin-bottom:4px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:11pt; font-weight:700;">Window signals log modules</span></h5><p><span style=" font-size:11pt;">1. activitiesChanged</span></p><p><span style=" font-size:11pt;">2. bufferGeometryChanged</span></p><p><span style=" font-size:11pt;">3. desktopsChanged</span></p><p><span style=" font-size:11pt;">4. fullScreenChanged</span></p><p><span style=" font-size:11pt;">5. interactiveMoveResizeStepped</span></p><p><span style=" font-size:11pt;">6. maximizedAboutToChange</span></p><p><span style=" font-size:11pt;">7. minimizedChanged</span></p><p><span style=" font-size:11pt;">8. moveResizedChanged</span></p><p><span style=" font-size:11pt;">9. outputChanged</span></p></body></html>
russian: <html><head/><body><h5 style=" margin-top:12px; margin-bottom:4px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-size:11pt; font-weight:700;">Список лог модулей сигналов Window</span></h5><p><span style=" font-size:11pt;">1. activitiesChanged</span></p><p><span style=" font-size:11pt;">2. bufferGeometryChanged</span></p><p><span style=" font-size:11pt;">3. desktopsChanged</span></p><p><span style=" font-size:11pt;">4. fullScreenChanged</span></p><p><span style=" font-size:11pt;">5. interactiveMoveResizeStepped</span></p><p><span style=" font-size:11pt;">6. maximizedAboutToChange</span></p><p><span style=" font-size:11pt;">7. minimizedChanged</span></p><p><span style=" font-size:11pt;">8. moveResizedChanged</span></p><p><span style=" font-size:11pt;">9. outputChanged</span></p></body></html>

source: Other
russian: Другие

source: <html><head/><body><p><span style=" font-size:11pt;">Also, in addition to the fact that you can include only the modules you need, you can enable </span><span style=" font-family:'Hack'; font-size:11pt;">Filter</span><span style=" font-size:11pt;"> checkbox and use other filters in filter line edit:</span></p><p><span style=" font-size:11pt;">- </span><span style=" font-size:11pt; font-weight:700;">winclass</span></p><p><span style=" font-size:11pt;">Examples:</span></p><p><span style=" font-family:'Hack'; font-size:11pt;">- </span><span style=" font-family:'Hack'; font-size:11pt; font-weight:700;">winclass=[konsole]</span><span style=" font-size:11pt; font-weight:700;"/><span style=" font-size:11pt;">- some modules may be filtered by a window class, so this logs modules will show only windows with class that contains </span><span style=" font-family:'Hack'; font-size:11pt;">konsole</span><span style=" font-size:11pt;"> word.</span></p><p><span style=" font-family:'Hack'; font-size:11pt;">- </span><span style=" font-family:'Hack'; font-size:11pt; font-weight:700;">!winclass=org.kde.elisa:org.kde.ruler</span><span style=" font-size:11pt;"> -Exclude Elisa and Kruler from log output</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:11pt;">Также в дополнение к тому, что вы можете включать только те модули которые нужны, вы можете включить</span><span style=" font-family:'Hack'; font-size:11pt;">Фильтр</span><span style=" font-size:11pt;"> чекбокс и использовать ещё один вид фильтров:</span></p><p><span style=" font-size:11pt;">- </span><span style=" font-size:11pt; font-weight:700;">winclass</span></p><p><span style=" font-size:11pt;">Примеры:</span></p><p><span style=" font-family:'Hack'; font-size:11pt;">- </span><span style=" font-family:'Hack'; font-size:11pt; font-weight:700;">winclass=[konsole]</span><span style=" font-size:11pt; font-weight:700;"/><span style=" font-size:11pt;">- некоторые модули могут быть отфильтрованы по классу окна и лог модули будут показывать логи только тех окон в которых есть слово </span><span style=" font-family:'Hack'; font-size:11pt;">konsole</span><span style=" font-size:11pt;"> .</span></p><p><span style=" font-family:'Hack'; font-size:11pt;">- </span><span style=" font-family:'Hack'; font-size:11pt; font-weight:700;">!winclass=org.kde.elisa:org.kde.ruler</span><span style=" font-size:11pt;"> - исключает из показа логов окна Elisa и Kruler </span></p></body></html>

source: Filter
russian: Фильтр
