Repository: UnsaltedScholar/krohnkite
Catalog: translations/*.po
Languages: russian

source: Form
russian: Форма

source: Layouts
russian: Схемы

source: <html><head/><body><p>0 - to disable</p></body></html>
russian: <html><head/><body><p>0 - выключить</p></body></html>

source: Tile Layout
russian: Схема Плитки

source: Order:
russian: Последовательность:

source: Initial rotation angle
russian: Начальный угол поворота

source: Monocle Layout
russian: Схема Монокля

source: All windows will be maximized in Monocle layout
russian: При схеме Монокля все окна будут развёрнуты

source: Fully maximize windows (no borders, no gaps)
russian: Полностью разворачивать окна (без рамок, без отступов)

source: Minimize unfocused windows (WIP)
russian: Сворачивать неактивные окна (WIP)

source: Three Column Layout
russian: Схема Трёх Колонок

source: Spiral Layout
russian: Схема Спирали

source: Quarter Layout
russian: Схема Четверти

source: Reset Quarter layout after closing a window
russian: Сбрасывать Схему Четверти после закрытия окна

source: Stacked Layout
russian: Схема Стопки

source: Columns Layout
russian: Схема Колонок

source: Creating a new window in the shortest column
russian: Новое окно в самой короткой колонке

source: Balanced
russian: Сбалансировать

source: Config
russian: Конфиг

source: <html><head/><body><p>Comma-separated list OutputName:VirtualDesktopName:ActivityId:ColumnWeight:ColumnWeight:... OutputName value you will see if run KSystemLog and type krohnkite in filter string. The data will right under Krohenkite start string.If all weights are equal they will not be taken into account </p><p>Example: Any monitors 3 columns without weights:</p><p>:::1:1:1</p><p>Example with desktop name and activity id 3 columns the third one is twice as big as the first two:</p><p>HDMI-A-1:Desktop 1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:1:1:2</p></body></html>
russian: <html><head/><body><p>Через запятую. Формат: OutputName:VirtualDesktopName:ActivityId:ColumnWeight:ColumnWeight:... OutputName -можно посмотреть запустив KSystemLog и напечатав krohnkite в строке фильтра. Данные будут сразу после строки "Krohnkite start". Если все веса "ColumnWeight" равны, то и колонки будут равны. </p><p>Примеры: 1. На всех мониторах 3 колонки без весов:</p><p>:::1:1:1</p><p>2. Это правило действует только на одном мониторе с виртуальным рабочим столом "Desktop 1" и толко на Активности с заданным номером. Там будут три колонки, причём последняя будет в два раза больше первых двух.</p><p>HDMI-A-1:Desktop 1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:1:1:2</p></body></html>

source: Spread Layout
russian: Схема Распространения

source: Floating Layout
russian: Схема Плавающая

source: Stair Layout
russian: Схема Лесенки

source: Reverse the stair layout's direction
russian: Изменить направление в схеме Лесенка

source: Binary Tree Layout
russian: Схема Бинарного Дерева

source: Cascade Layout
russian: Схема Каскадная

source: Geometry
russian: Геометрия

source: Default Gaps
russian: Отступы

source: Top
russian: Верхний

source: Bottom
russian: Нижний

source: Left
russian: Левый

source: Right
russian: Правый

source: Between tiles
russian: Между

source: Override default gaps for a screen
russian: Переопределить отступы для монитора

source: <html><head/><body><p><span style=" font-size:12pt;">Overriding default gaps parameters for the specified Screen Name(OutputName). Format:</span></p><p><span style=" font-size:12pt; font-weight:700;">OutputName:&lt;left,right,top,bottom,between&gt;=number,...&lt;Enter&gt;</span></p><p><span style=" font-size:12pt; font-weight:700;">OutputName:ActivityId:VirtualDesktopName:&lt;left,right,top,bottom,between&gt;=number,...&lt;Enter&gt;</span></p><p><span style=" font-size:12pt; font-weight:700;">xrandr --listmonitors</span><span style=" font-size:12pt;"> to define Output names</span></p><p><span style=" font-size:12pt; font-weight:700;">left,right,top,bottom,between</span><span style=" font-size:12pt;"> or you can use shortname</span><span style=" font-size:12pt; font-weight:700;"> l,r,t,b,e </span></p><p><span style=" font-size:12pt;">You can only write down the parameters you want to change. Examples:</span></p><p><span style=" font-size:12pt;">on monitor with Output name </span><span style=" font-size:12pt; font-weight:700;">DP-2 </span><span style=" font-size:12pt;">will override right gap to 10, left gap to 20 and between gap to 10</span></p><p><span style=" font-size:12pt; font-weight:700;">DP-2:r=10,l=20,between=10</span></p><p><span style=" font-size:12pt;">this one, will override between gaps only for defined display, virtual desktop and activity</span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:Desktop 1:e=0</span></p></body></html>
russian: html><head/><body><p><span style=" font-size:12pt;">Переопределение отступов для заданного монитора(OutputName). Формат:</span></p><p><span style=" font-size:12pt; font-weight:700;">OutputName:&lt;left,right,top,bottom,between&gt;=number,...&lt;Enter&gt;</span></p><p><span style=" font-size:12pt; font-weight:700;">OutputName:ActivityId:VirtualDesktopName:&lt;left,right,top,bottom,between&gt;=number,...&lt;Enter&gt;</span></p><p><span style=" font-size:12pt; font-weight:700;">xrandr --listmonitors</span><span style=" font-size:12pt;"> - команда чтобы посмотреть имена мониторов</span></p><p><span style=" font-size:12pt; font-weight:700;">left,right,top,bottom,between</span><span style=" font-size:12pt;"> или вы можете использовать короткие имена</span><span style=" font-size:12pt; font-weight:700;"> l,r,t,b,e </span></p><p><span style=" font-size:12pt;">Вы можете записать только те параметры, которые хотите изменить. Примеры:</span></p><p><span style=" font-size:12pt;">на мониторе с именем</span><span style=" font-size:12pt; font-weight:700;">DP-2 </span><span style=" font-size:12pt;">будет установлен правый отступ в 10 пикселей, левый в 20 и между окнами будет 10</span></p><p><span style=" font-size:12pt; font-weight:700;">DP-2:r=10,l=20,between=10</span></p><p><span style=" font-size:12pt;">а в этом будет убран интервал между окнами только для заданного монитора, виртуального рабочего стола и Активности</span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:Desktop 1:e=0</span></p></body></html>

source: Maximum Tile Width
russian: Максимальная ширина плитки

source: Ratio of the max width to screen height
russian: Соотношение макс.ширины к высоте экрана

source: <html><head/><body><p>value 1.6 means the width of the tile can be 60% greater than the height</p></body></html>
russian: <html><head/><body><p>Значение 1.6 значит, что ширина тайла будет максимум на 60% больше его высоты.</p></body></html>

source: Limit the width of tiled windows
russian: Ограничить ширину Тайлов

source: Behavior
russian: Поведение

source: Layout Adjustment
russian: Выравнивание Схемы

source: Resizing window will cause layout to be adjusted. The actual behaviour might differ based on layout in use.
russian: Изменение размена окна будет влиять на размер схемы. Это поведение зависет от выбранной схемы.

source: Adjust layout by resizing windows
russian: Менять размер схемы, изменяя размер окон

source: If enabled, resizing window will immediately adjust layout. If disabled, layout will be adjusted *after* window resizing is over.
russian: Если включён, изменение размера окна будет немедленно менять размер схемы. Если выключен, размер схемы будет изменяться после окончания изменения окна.

source: Adjust layout in realtime as window is being resized
russian: Изменять Схему в реальном времени, как только окно изменило размер

source: Directional Keys Behaviors
russian: Поведение клавиш направления

source: Up
russian: Верх

source: Directional
russian: Направленный

source: DWM st&yle
russian: в стиле DWM

source: Focus Next
russian: Фокус След

source: Down
russian: Вниз

source: Focus Prev
russian: Фокус пред

source: Adjust Layout
russian: Размер Схемы

source: Focus Up
russian: Фокус Вверх

source: Focus Down
russian: Фокус Вниз

source: Focus Left
russian: Фокус Влево

source: Focus Right
russian: Фокус Вправо

source: Position of the New Window
russian: Позиция для Нового окна

source: Last
russian: Последняя

source: First
russian: Первая

source: Second
russian: Вторая

source: Rules
russian: Правила

source: Ignore Windows
russian: Игнорировать Окна

source: By Title
russian: По Заголовку

source: By Class
russian: По Классу

source: Comma-separated list of window classes. Matching windows will not be tiled.
russian: Через запятую список классов(windowClass или ResourceClass) окон, которые будут игнорироваться.

source: Comma-separated list of keywords(or substrings). Any windows with matching title will not be tiled.
russian: Через запятую список слов(или части предложения). Любые окна с заголовками(title) содержащими эти слова будут игнорироваться.

source: By Role
russian: По Роли

source: Float Windows
russian: Плавающие Окна

source: Comma-separated list of window classes. Matching windows will become float automatically.
russian: Через запятую список классов(windowClass или ResourceClass) окон, которые будут становиться плавающими автоматически.

source: Comma-separated list of keywords(or substrings). Any windows with matching title will become float automatically
russian: Через запятую список слов(или части предложения). Любые окна с заголовками(title) содержащими эти слова будут становиться плавающими автоматически

source: This is mainly for debugging purpose, but can also be used to meet some specific requirements.
russian: В основном для отладочных целей, но также может использоваться в специальных ситуациях.

source: Float utility windows (applies to window type Dialog, Splash, Utility)
russian: Делать все вспомогательные(диалоговые,всплывающие и т.д) окна плавающими.

source: Disable Tiling
russian: Выключение Тайлинга

source: <html><head/><body><p>Comma-separated list of activity IDs. See Readme or Issue #125 to know IDs. Windows in corresponding activities will not be tiled.</p></body></html>
russian: <html><head/><body><p>Через запятую список номеров Активностей(activity IDs). Смотри Документацию или Issue #125 чтобы узнать эти номера. Окна относящиеся к этой Активности будут игнорироваться.</p></body></html>

source: On Activity (activityId)
russian: На Активности(activityId)

source: On Screen (name)
russian: На Мониторе

source: Comma-separated list of screen names. Windows in corresponding screens will not be tiled.
russian: Через запятую список имён мониторов. Окна на этих мониторах будут игнорироваться.

source: On Virtual Desktop
russian: На Вирт.Раб.Столе

source: Comma-separated list of Virtual Desktops names. Windows corresponding to these will not be tiled.
russian: Через запятую имена Виртуальных Рабочих Столов. Все окна на этих столах будут игнорироваться.

source: Always, except by class
russian: Всё, кроме классов

source: Comma-separated list of window classes. Matching windows will become tiled automatically.
russian: Через запятую список классов окон. Совпадающие окна не будут проигнорированы.

source: Screen default layout
russian: Схема по умолчанию для монитора

source: <html><head/><body><p>Comma-separated list OutputName:LayoutName. 'Layout' word can be omit. </p><p>2 monitors example: HDMI-A-1:spread,DP-2:tile</p><p>Example with desktop name: HDMI-A-1:Desktop 1:1,HDMI-A-1:Desktop 2:columns</p></body></html>
russian: <html><head/><body><p>Разделённый запятыми список ИмяМонитора:ИмяСхемы. Схему нужно писать на английском, так как она пишется на экране при её включении, слово 'layout' можно не писать. </p><p>Пример для двух мониторов: HDMI-A-1:spread,DP-2:tile</p><p>Example with desktop name: HDMI-A-1:Desktop 1:1,HDMI-A-1:Desktop 2:columns</p></body></html>

source: OutputName:LayoutName,...
russian: ИмяМонитора:ИмяСхемы

source: Dock
russian: Док

source: <html><head/><body><p>hv - short name</p></body></html>
russian: <html><head/><body><p>короткое имя - hv </p></body></html>

source: Surfaces configuration
russian: Конфигурация Поверхности

source: Order of docked windows
russian: Очерёдность пристыковки окон

source: Off
russian: Выключить

source: Third
russian: Третий

source: Fourth
russian: Четвёртый

source: <html><head/><body><p><span style=" font-size:12pt;">Overriding default parameters for every surface. Format: </span><span style=" font-size:12pt; font-weight:700;">OuputName:ActivityId:VirtualDesktopName:shortname=value,shortname=value... &lt;Enter&gt;</span></p><p><span style=" font-size:12pt;">You can only write down parameters you want to change. You can see the short name of the parameter if you hover over any default parameter above.</span></p><p><span style=" font-size:12pt;">Next example override three params on all surfaces with OutputName=HDMI-A-1 </span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:::hh=80,vw=80,ha=left</span></p><p><span style=" font-size:12pt;">this one, will override two params only for defined display, virtual desktop and activity</span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:Desktop 1:vg=5,va=2</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">Переопределение параметров для поверхности. Формат: </span><span style=" font-size:12pt; font-weight:700;">OuputName:ActivityId:VirtualDesktopName:shortname=value,shortname=value... &lt;Enter&gt;</span></p><p><span style=" font-size:12pt;">Вы можете писать только те параметры, значение которых хотите переопределить. Вы увидите короткие имена параметров если наведёте мышь на любой из параметров.</span></p><p><span style=" font-size:12pt;">Следующий пример переопределяет три параметра на всех поверхностях с OutputName=HDMI-A-1 </span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:::hh=80,vw=80,ha=left</span></p><p><span style=" font-size:12pt;">этот пример переопределит два параметра на полностью определённой поверхности</span></p><p><span style=" font-size:12pt; font-weight:700;">HDMI-A-1:99e10d31-e8f3-44aa-bbed-2a543f13fa54:Desktop 1:vg=5,va=2</span></p></body></html>

source: Default settings for a docked window
russian: Параметры пристыкованного окна

source: Up/Bottom Dock
russian: Верхний/Нижний Док

source: <html><head/><body><p><span style=" font-size:12pt;">short name:</span><span style=" font-weight:700;">hh</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя:</span><span style=" font-weight:700;">hh</span></p></body></html>

source: Height
russian: Высота

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">hw</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">hw</span></p></body></html>

source: <html><head/><body><p>vw - short name</p></body></html>
russian: <html><head/><body><p>короткое имя: vw </p></body></html>

source: Wide
russian: Ширина

source: Gaps
russian: Отступы

source: Horizontal
russian: По ширине

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">hgv</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">hgv</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name:</span><span style=" font-weight:700;">hgh</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя:</span><span style=" font-weight:700;">hgh</span></p></body></html>

source: Vertical
russian: По высоте

source: Alignment
russian: Выравнивание

source: Horizontal
russian: По ширине

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">he</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">he</span></p></body></html>

source: Outside
russian: Наружу

source: Middle
russian: Посередине

source: Inside
russian: Внутрь

source: <html><head/><body><p><span style=" font-size:12pt;">short name:</span><span style=" font-weight:700;">ha</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя:</span><span style=" font-weight:700;">ha</span></p></body></html>

source: Center
russian: По центру

source: Left/Right Dock
russian: Левый/Правый док

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">vh</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">vh</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">vw</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">vw</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name:</span><span style=" font-weight:700;">vgh</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя:</span><span style=" font-weight:700;">vgh</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name:</span><span style=" font-weight:700;">vgv</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя:</span><span style=" font-weight:700;">vgv</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">va</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">va</span></p></body></html>

source: <html><head/><body><p><span style=" font-size:12pt;">short name: </span><span style=" font-weight:700;">ve</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">короткое имя: </span><span style=" font-weight:700;">ve</span></p></body></html>

source: Window class configuration
russian: Конфигурация для класса окна

source: <html><head/><body><p><span style=" font-size:12pt;">Overriding default parameters for the specified WindowClass. Format:</span></p><p><span style=" font-size:12pt; font-weight:700;">WindowClass:SpecialFlag,SpecialFlag...:shortname=value,shortname=value...</span></p><p><span style=" font-size:12pt; font-weight:700;">pin - </span><span style=" font-size:12pt;">docked window with this flag will displace another if their positions are equal.</span></p><p><span style=" font-size:12pt; font-weight:700;">left,right,top,bottom</span><span style=" font-size:12pt;"> - you can use one them to explicitly set the initial position.</span></p><p><span style=" font-size:12pt; font-weight:700;">auto</span><span style=" font-size:12pt;"> - automatically makes a window docked. Krohnkite version &gt;=0.9.9.1</span></p><p><span style=" font-size:12pt;">You can only write down the parameters you want to change. You can see the short name of the parameter if you hover over any default parameter above.</span></p><p><span style=" font-size:12pt;">Examples:</span></p><p><span style=" font-size:12pt;">1. if Elisa switches to dock it will have higher priority, top dock position and 10% of screen height </span></p><p><span style=" font-size:12pt;">org.kde.elisa</span><span style=" font-size:12pt; font-weight:700;">:pin,top:hh=10</span></p><p><span style=" font-size:12pt;">2. Conky automatic docking</span></p><p><span style=" font-family:'Hack'; font-size:12pt;">Conky:</span><span style=" font-family:'Hack'; font-size:12pt; font-weight:700;">auto</span><span style=" font-family:'Hack'; font-size:12pt;">:</span></p></body></html>
russian: <html><head/><body><p><span style=" font-size:12pt;">Переопределение параметров для указанного WindowClass(ResourceClass). Формат:</span></p><p><span style=" font-size:12pt; font-weight:700;">КлассОкна:СпециальныйФлаг,СпециальныйФлаг...:короткоеИмя=значение,короткоеИмя=значение...</span></p><p><span style=" font-size:12pt; font-weight:700;">pin - </span><span style=" font-size:12pt;">пристыкованное окно с этим специальным флагом будет вытеснять другое окно с такой же позицией.</span></p><p><span style=" font-size:12pt; font-weight:700;">left,right,top,bottom</span><span style=" font-size:12pt;">- использование одного из этих специальных флагов явно указывает начальную позицию.</span></p><p><span style=" font-size:12pt; font-weight:700;">auto</span><span style=" font-size:12pt;"> - автоматически пристыковывать окно. Версия Krohnkite&gt;=0.9.9.1</span></p><p><span style=" font-size:12pt;">Можно указывать только те параметры, которые хотите изменить. КороткоеИмя можно увидеть если навести мышью на поле с этим параметром.</span></p><p><span style=" font-size:12pt;">Примеры:</span></p><p><span style=" font-size:12pt;">1.Если Elisa будет пристыкованна она будет иметь повышенный приоритет, верхнюю позицию и высота будет 10% от высоты экрана</span></p><p><span style=" font-size:12pt;">org.kde.elisa</span><span style=" font-size:12pt; font-weight:700;">:pin,top:hh=10</span></p><p><span style=" font-size:12pt;">2. Conky авто пристыковка</span></p><p><span style=" font-family:'Hack'; font-size:12pt;">Conky:</span><span style=" font-family:'Hack'; font-size:12pt; font-weight:700;">auto</span><span style=" font-family:'Hack'; font-size:12pt;">:</span></p></body></html>

source: Options
russian: Опции

source: Window Layer
russian: Слой окна

source: Tiled
russian: Тайлед

source: Normal
russian: Нормальный

source: Above
russian: Выше

source: Float
russian: Плавающее

source: The Sole Window properties
russian: Свойства единственного окна

source: Width
russian: Ширина

source: No Borders
russian: Убрать обрамление

source: No Gaps
russian: Убрать отступы

source: Notifications
russian: Оповещения

source: <html><head/><body><p>Set the time (in milliseconds) for how long a pop-up notification will remain visible before it automatically disappears. A value of 0 will disable notifications.</p></body></html>
russian: <html><head/><body><p>Установить время(в миллисекундах) отображения всплывающих оповещений. Значение Ноль отключит всплывающие оповещения.</p></body></html>

source: Duration
russian: Продолжительность

source: All tiled windows will have no borders. Borders will be added back if window become float.
russian: Все тайлинговые окна не будут иметь обрамлений, они появятся если окно станет плавающем.

source: Use separate layouts for each Activity
russian: Для каждой Активности использовать свою Схему

source: Use separate layouts for each Desktop
russian: Для каждого Виртуального Рабочего Стола использовать свою Схему

source: Remove borders of tiled windows
russian: Удалять обрамление для тайлинговых окон

source: Always preserve the tiling status of a window upon dragging
russian: Сохранять окно тайлинговым во время перетаскивания

source: Prevent windows from minimizing (experimental)
russian: Предотвращать сворачивание окон(экспериментально)

source: Prevent window from protruding from its screen
russian: Предотвращать выход окна за границы экрана

source: <html><head/><body><p>If enabled, all windows with property skipPager=true become floating. You can create KDE Window Rule and force skipPager=true.</p></body></html>
russian: <html><head/><body><p>Если включён, все окна со свойством skipPager=true станут плавающими. Нужно создать Правило для Окна в KDE skipPager=true. Более подробно читайте в Github Вики</p></body></html>
